app/Views/fragments/map.php

                <?php
                $db = db_connect();
                $builder = $db->table('geotags')->where('date', date('Y-m-d'))->orderBy('date', 'DESC');
                $query = $builder->get();
---
SELECT *
FROM `geotags`
WHERE `date` = '2025-09-02'
ORDER BY `date` DESC