app/Controllers/Employee.php

SELECT *
FROM `employees`
WHERE `employeeID` = '99871'
 LIMIT 1
---
    public function api_login()
    {
        //
        $employeeModel = new EmployeeModel();

        $employeeID = $this->request->getVar('employeeID');

        $user = $employeeModel->where('employeeID', $employeeID)->first();