app/Controllers/FIautoController.php

    public function auto_mail_fi_start()
    {
        $memberId = $this->request->getVar('member_id');
        log_message('info', 'FIautoController auto_mail_fi_start called with member_id: ' . $memberId);
        if (!$memberId) {
            return $this->respond([
                'status' => false,
                'message' => 'member_id is required.'
            ], 400);
        }

        $db = db_connect();
        $builder = $db->table('retailerdocuments');

        $documents = $builder
            ->where('member_id', $memberId)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `retailerdocuments`
WHERE `member_id` = 'XYZB2222'