app/Controllers/LoanApi.php

    public function applied_loan()
    {
        //
        $model = new LoanModel();
        $data = [

            'groupId'       => $this->request->getVar('groupID'),
            'member_id'     => $this->request->getVar('memberID'),
            'loan_amount'   => $this->request->getVar('loanAmount'),
            'loan_tenure'        => $this->request->getVar('tenure'),
            'loan_type'     => $this->request->getVar('loanType'),
            'employee_id'   => $this->request->getVar('employeeID'),
            'applicationID' => rand(10000, 99999) . $this->request->getVar('memberID'),

        ];
        // $query = $model->insert($data);
        $query = $model->save($data);
---
INSERT INTO `loans` (`groupId`, `member_id`, `loan_amount`, `loan_type`, `employee_id`) VALUES ('379', '56445456', '500000', 'Housing', '58796')

    public function update_of_loan()
    {
        $model = new LoanModel();
        $db = db_connect();
        $builder = $db->table('loans');
        $applicationid   = $this->request->getPost('applicationid');
        $table = "tab_" . $applicationid;
        $status = $this->request->getPost('status');
        $loan_amount = $this->request->getPost('lona_amount');
        $tenure = $this->request->getPost('tenure');
        $roi = "12";
        if ($status == "Approved") {
            # code...
            $model->create($table);
            $r = ($roi / 100 / 12);
            $x = pow(1 + $r, $tenure);
            $emi = round(($loan_amount * $x * $r) / ($x - 1));
            $due = round($emi * $tenure);
            $data = [

                'loan_status'       => "Approved",
                'loan_tenure'       => $tenure,
                'emi'               =>  $emi,
                'pending_emi'       =>  $tenure,
                'loan_due'          => $due,
            ];

            $builder->where('applicationID', $applicationid);
            $query = $builder->update($data);
---
UPDATE `loans` SET `loan_status` = 'Approved', `loan_tenure` = '12', `emi` = 7565, `pending_emi` = '12', `loan_due` = 90780, `roi` = '24', `total_amount` = 90780
WHERE `applicationID` = '65277TEST5860'