app/Controllers/LoanEligibilityController.php

UPDATE `members` SET `location` = 'Kolkata', `pincode` = '700156', `mobile` = '8013065976', `pan` = '8013065976/NA', `gst` = NULL, `adhar` = '8013065976/N', `footFall` = '20', `stock` = '20000', `outstanding` = '0', `estab` = '2012', `dailySales` = '2000', `name` = 'Anisha', `eli_run` = 'Y', `month_purchase` = '0', `remarks` = 'Reject', `comments` = 'Doc Not Valid'
WHERE `member_id` = 'ANIS5976'
---
        $db = db_connect();
        $builder = $db->table('members');
        $builder->where('member_id', $request->getVar('memberID'));
        $query = $builder->update($data_update);

INSERT INTO `initial_eli_run` (`cibil`, `eligibility`, `first_date`, `loan_amount`, `member_id`, `reason`, `roi`, `score`, `tenure`)
VALUES ('780','Eligible','2025-04-22',50000,'ANIS5976','Eligible for the loan.',28,7,12)
ON DUPLICATE KEY UPDATE
`initial_eli_run`.`cibil` = VALUES(`cibil`),
`initial_eli_run`.`eligibility` = VALUES(`eligibility`),
`initial_eli_run`.`first_date` = VALUES(`first_date`),
`initial_eli_run`.`loan_amount` = VALUES(`loan_amount`),
`initial_eli_run`.`member_id` = VALUES(`member_id`),
`initial_eli_run`.`reason` = VALUES(`reason`),
`initial_eli_run`.`roi` = VALUES(`roi`),
`initial_eli_run`.`score` = VALUES(`score`),
`initial_eli_run`.`tenure` = VALUES(`tenure`)
---
        ];
        $db = db_connect();
        $builder = $db->table('initial_eli_run');
        $builder->upsert($data_eli_run);