app/Controllers/MemberController.php

    public function member_view_api()
    {
        //
        $model = new MemberModel();
        $memberID = $this->request->getVar('memberID');

        $member = $model->where('member_id', $memberID)->first();
---
SELECT *
FROM `members`
WHERE `member_id` IS NULL