app/Controllers/MemberController.php

SELECT *
FROM `members`
WHERE `member_id` = 'SIDH2095'
 LIMIT 1
---
    public function retailer_profile($memberID)
    {
        // $session = session();
        $model = new MemberModel();
        $data['retailers'] = $model->where('member_id', $memberID)->first();