app/Views/dashboard.php

                                        $db = db_connect();
                                        $builder = $db->table('groups');

                                        $query = $builder->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `groups`

                                        $db = db_connect();
                                        $builder_mem = $db->table('members');

                                        $query_mem = $builder_mem->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `members`