app/Views/employee.php

                                <?php
                                $db = db_connect();
                                $builder = $db->table('employees');
                                $query = $builder->get();
---
SELECT *
FROM `employees`