app/Views/loan.php

SELECT *
FROM `employees`
WHERE `employeeID` = '58796'
---
                                    $e_id =  $row->employee_id;
                                    $builder_name = $db->table('employees');
                                    $builder_name->where('employeeID', $e_id);
                                    $query_name = $builder_name->get();