app/Views/member_edit.php

        $elirun = $row->eli_run;
        $builder_name = $db->table('employees');
        $builder_name->where('employeeID', $e_id);
        $query_name = $builder_name->get();
---
SELECT *
FROM `employees`
WHERE `employeeID` = '0009'

                            # code...
                            $builderB = $db->table('initial_eli_run');
                            $builderB->select('*');
                            $builderB->where('member_id ', $row->member_id);
---
SELECT *
FROM `initial_eli_run`
WHERE `member_id` = 'K.G.3498'