app/Views/members.php

SELECT *, `members`.`name` as `owner`, `members`.`mobile` as `r_mobile`, `members`.`created_at` as `r_created_at`
FROM `members`
JOIN `employees` ON `employees`.`employeeID` = `members`.`agent`
JOIN `groups` ON `groups`.`g_id`  = `members`.`groupId`
---
                                $db = db_connect();
                                $builder = $db->table('members')->select('*, members.name as owner,members.mobile as r_mobile,members.created_at as r_created_at')
                                    ->join('employees', 'employees.employeeID = members.agent')->join('groups', 'groups.g_id  = members.groupId');
                                $query = $builder->get();

SELECT *
FROM `initial_eli_run`
WHERE `member_id` = 'K.G.3498'
---
                                        if ($row->eli_run === "Y") {
                                            $builderB = $db->table('initial_eli_run');
                                            $builderB->select('*');
                                            $builderB->where('member_id ', $row->member_id);